/**
 * @param {number} num
 * @return {number}
 */
var addDigits = function(num) {
    /**
     * 0 : 0
     * 1 : 1
     * ...
     * 9 : 9
     * 10 : 1
     * 11 : 2
     * ...
     * 19 : 1
     * 20 : 2
     * ...
     * 28 : 1
     * 29 : 2
     * 30 : 3
     * ...
     * 81 : 9
     * 82 : 1
     * 83 : 2
     * ...
     * 91 : 1
     * 92 : 2     92 / 10 = 9 ; 9 + 2 % 9=
     * ...
     * 100 : 1
     * 999 : 9
     * 右侧循环1-9  左侧循环0-9   除了0
     * 十进制转9进制, 十进制每一轮比9进制多1,  num / 10 得到已有轮数, 得知目前十进制该数比九进制多出多少;
     * num % 10 得到
     *
     */
    return (num -1) % 9 + 1;
};